---
kind: property
id: P:Autodesk.Revit.DB.FabricationServiceButton.IsStraight
source: html/56374bfd-ca22-5d96-2e5e-36ed22914668.htm
---
# Autodesk.Revit.DB.FabricationServiceButton.IsStraight Property

Checks if all of the fabrication service button conditions are straights.

## Syntax (C#)
```csharp
public bool IsStraight { get; }
```